# ExternalResourceUtils Methods

---
The ExternalResourceUtils type exposes the following members.
| Name| Description
---|---|---
| GetAllExternalResourceReferences(Document)|  Gets the ids of all elements which refer to external resources.
| GetAllExternalResourceReferences(Document, ExternalResourceType)|  Gets the ids of all elements which refer to a specific type of external resource.
Top
#### Reference
ExternalResourceUtils Class
Autodesk.Revit.DB Namespace